Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.WrongConstraintInTrussSketch
Structural Truss sketch can't be constrained to its members.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.WrongConstraintInSkeletonSketch
Reference Lines can only be constrained to Reference Planes, Levels, Family Host, and other Reference Lines.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.WrongConstraintInJoistSystemSketch
Structural Beam System sketch can't be constrained to its beam.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.WrongConstraintInGridChainSketch
Curve in a GridChain sketch cannot be constrained to a sub-grid

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.UnstableConstraintInFamily
Constraints between geometry in the family can behave unpredictably on parameter modification.  To make the family reliable, constrain geometry to levels, reference planes, or reference lines.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.UnavailableDimensionHostReference
A dimension reference could not be resolved on the host element.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.SpotSlopeReferencePointIsSingular
The highlighted Spot Slope references an element point that is singular.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.SpotSlopeReferenceIsVertical
The highlighted Spot Slope references an element that is vertical.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.SpotElevationMissesReference
Spot Dimension does not lie on its reference.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.SpotElevationLostEdgeReferences
Some Spot Dimensions lost their References. Those Spot Dimensions will be deleted.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.SpotDimensionReferencesNoLongerHorizontal
One or more Spot Dimension references are no longer valid.  Spot Dimensions can generally reference
only those references which have valid coordinates in the view.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.SpotDimensionFormerSetMoribundCall
One or more Spot Dimension references are no longer valid.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.SpotDimensionFloatingPointError
Some spot dimensions contain invalid floating-point values.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.SomeSpotDimensionsLostOnPaste
Some Spot Dimensions were not copied because some References were lost.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.SomeDimensionsLostWitnessLines
Some Dimensions lost some of their References on paste.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.SomeDimensionsLostOnPaste
Some Dimensions were not copied because some References were lost.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.ReportingParamAlreadyLabelsToAnotherDim
Cannot label multi-dimensions to one reporting parameter.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.RegenConstraintUnsatisfiedWarn
Constraints are not satisfied

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.RegenConstraintUnsatisfied
Constraints are not satisfied

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.RadialDimensionChangeRadiusFailed
Can't change radius.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.RadialDimensionCannotProjectToArc
Cannot form radial dimension.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.NoConstraintsToLinks
Constraints may not be created to linked instances using Shared Locations.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.NoConstraintsInProperSketch
You are creating a constraint inside the sketch of a property line.  Constraints inside a sketch can only drive elements within the sketch.  Usually you do not want property lines driven by other elements.  If you would like to constrain other elements to the property lines, you should add the constraints outside of sketch mode.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.MoreThanOneDimsLabelToOneReportingParameter
Reporting parameters can only exist on a single dimension/constraint.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.LooseLabeledDimensionRegenFailure
Failed to Regenerate Family

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.LockOverconstrainedAlignment
Locking this alignment would overconstrain the sketch.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.LockOverconstrained
Locking this dimension would overconstrain the sketch.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.LinearDimensionReferenceNotOrthogonalToView
The planes of one or more references are not exactly orthogonal to this view.  The dimension to these reference cannot be created.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.LinearConstraintNotParallel
The References of the highlighted Dimension are no longer parallel.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.LinearConstraintBadDirection
Bad direction vector in dimension element.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.LabelingMultiSegmentWithReporting
Cannot label multi-segment dimensions with reporting parameters.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.LabelingDimWithGroupReferences
Labeled constraints cannot participate in groups.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.LabelOverconstrained
Labeling this dimension would overconstrain the sketch.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.ForbiddenGroupConstraint
You may not create sketch or family constraints between group members and elements which are not members of the same group.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.EqualityConstraintsUnsatisfiedWarn
Equality constraints are not satisfied.  The action either violates a locked constraint or tries to modify
a sketch based object outside of the sketch mode.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.EqualityConstraintsUnsatisfied
Equality constraints are not satisfied.  The action either violates a locked constraint or tries to modify
a sketch based object outside of the sketch mode.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.DimensionUnlockedAndUnequaled
Dimension had to be unlocked in order to remove sketch over-constraining.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.DimensionUnlocked
Dimension had to be un-EQed in order to remove sketch over-constraining.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.DimensionUnequaled
Dimension had to be unlocked and un-EQed in order to remove sketch over-constraining.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.DimensionReferencesInvalid
One or more dimension references are or have become invalid.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.DimensionPerpendicularToView
The Dimension is perpendicular to the current view, and no longer valid.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.DimensionOverrideNearByIsLost
The dimension segment containing the override(s) shown below has been removed. The override text will no longer appear. [Description]

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.DimensionOverconstrainedError
The Dimension would overconstrain the Sketch.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.DimensionOverconstrained
The Dimension would overconstrain the Sketch.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.DifferentLabelsInMultiSegmentDim
All segments of a multi-segment dimension must be labeled the same.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.ChangeSpotElevationFailed
Can't change Spot Elevation to the desired value.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.ChangeDimensionSegmentFailed
Can't change dimension segment to this value.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.CannotToggleDimensionEquality
Toggling the dimension's equality constraint would overconstrain the sketch.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.CannotLockThisDimension
Can't lock this Dimension because it breaks formulas

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.CannotDragWitnessLine
Moving the Witness Line conflicts with other Constraints in the Sketch.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.CannotCreateDimensionNotParallel
Can't create dimension. Highlighted references are not parallel to first selection.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.CannotConstrainBasePointDimensions
Dimensions to base points cannot be constrained.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.CannotConstrainBasePointAlignments
Alignments to base points cannot be constrained.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.AssocpropNeedJog
Need to add jog in order to satisfy constraints

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.ArcLengthDimensionReferencesNotIntersect
One or more dimension references of this Arc Length dimension no longer intersect the circle needed for arc length computation.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.ArcLengthDimensionNoReferencesOnArc
None of the segment references of this Arc Length Dimension intersects the bounded arc of the arc reference.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.ArcAlignmentRegenFailed
Can't form arc alignment.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.AngularDimensionRegenFailed
Can't form Angular Dimension.

Autodesk.Revit.DB.BuiltInFailures.DimensionFailures
Failures about DimensionFailures.